//***************************************************************************
//  Author(s):    Владимир Иванишин (http://de.my1.ru)
//  Target(s):    LCD from NOKIA5110
//  Compiler:     GCC
//  Description:  Библиотека дисплея от телефона NOKIA5110
//  Data:         12.12.17
//***************************************************************************
// Описания файла: в данном файле находятся все функции работы с дисплеем.
//***************************************************************************
#include "NOKIA5110.h"
#include "Fonts.h"
//***************************************************************************



//***************************************************************************
// Инициализация дисплея
//***************************************************************************
void LCD5110_Init(void)
{
	__LCD5110_DDR |= (1<<__LCD5110_R)|(1<<__LCD5110_CE)|(1<<__LCD5110_DC)|(1<<__LCD5110_DIN)|(1<<__LCD5110_CLK);

	__LCD5110_Port &= ~(1<<__LCD5110_R);				// Сброс дисплея
	_delay_us(1);
	__LCD5110_Port |= (1<<__LCD5110_R);
	
	__LCD5110_Port &= ~(1<<__LCD5110_CE);				// Включение дисплея
	_delay_us(1);
	__LCD5110_Port |= (1<<__LCD5110_CE);
	_delay_us(1);
	
	LCD5110_SendByte(0b00100001, 0);					// Адресация: горизонтальная
														// Тип функций: расширенный 
	LCD5110_SendByte(0b11001000, 0);					// Напряжение на генераторе ПН 7.38 вольт 
	LCD5110_SendByte(0b00000110, 0);					// Режим температурной коррекции 
	LCD5110_SendByte(0b00010011, 0);					// Напряжение смещения 
	LCD5110_SendByte(0b00100000, 0);					// Тип функций: обычный 
	LCD5110_Clear();
	LCD5110_SendByte(0b00001100, 0);					// Инверсия: отключена
														// Вывод изображения: включен 
	__LCD5110_Port &= ~(1<<__LCD5110_CE);
}



//***************************************************************************
// Очистка дисплея
//***************************************************************************
void LCD5110_Clear(void)
{
	unsigned int i;

	LCD5110_SendByte(0x40, 0);							// Переходим в первую строку							
	LCD5110_SendByte(0x80, 0);							// В первый столбец

	for (i=0; i<504; i++)
		LCD5110_SendByte(0, 1);							// И пхаем все это дело внутрь
}



//***************************************************************************
// Установка начала координат дисплея
//***************************************************************************
void LCD5110_SetXY(unsigned char X, unsigned char Y)
{
	 LCD5110_SendByte(0x40 | Y, 0);						// Строка
	 LCD5110_SendByte(0x80 | X, 0);						// Столбец
}



//***************************************************************************
// Вывод строки на дисплей
//***************************************************************************
void LCD5110_Prints(char *s, unsigned char X, unsigned char Y)
{
	LCD5110_SetXY(X,Y);
	while (*s)
	{
		LCD5110_Putc(*s);
		s++;
	}
}



//***************************************************************************
// Вывод символа на дисплей
//***************************************************************************
void LCD5110_Putc(unsigned char c)
{
	unsigned char i;
	
	if (c >= 'А')
		c -= 97;
	else
		c -= 32;
	
	for (i = 0; i < 5; i++)
		LCD5110_SendByte(pgm_read_byte(SmallFont[c]+i), 1);
	LCD5110_SendByte(0, 1);
}



//***************************************************************************
// Отправка байта на дисплей
//***************************************************************************
void LCD5110_SendByte(unsigned char data, unsigned char command)
{
	unsigned char i;		
	
	__LCD5110_Port &= ~(1<<__LCD5110_CE);				// Активируем контроллер дисплея
	
	if (command == 0)									// Если отправляем комманду,...
		__LCD5110_Port &= ~(1<<__LCD5110_DC);			// ...то сбрасываем вывод комманда/данные
	else
		__LCD5110_Port |= (1<<__LCD5110_DC);			// Иначе устанавливаем, показывая то, что мы передаем данные

	for(i = 0; i < 8; i++)								// По очереди проталкиваем байт. Бит за битом
	{
		if(data & 0x80)
			__LCD5110_Port |= (1<<__LCD5110_DIN);
		else
			__LCD5110_Port &= ~(1<<__LCD5110_DIN);
		
		__LCD5110_Port &= ~(1<<__LCD5110_CLK);
		data = data << 1;
		__LCD5110_Port |= (1<<__LCD5110_CLK);
	}
	__LCD5110_Port |= (1<<__LCD5110_CE);				// В конце отключаем контроллер от шины
}



void HeaderPrints(char *s)
{
	unsigned char length = 0;
	unsigned char i, sm;
	
	while (s[length])
		length++;
	
	LCD5110_SetXY(0, 0);
	for (i = 0; i < 84*2; i++)
		LCD5110_SendByte(0xFF, 1);
	
	for (unsigned char str = 0; str <= 1; str++)
	{
		LCD5110_SetXY((84-length*6)/2, str);
		i = 0;
		while(s[i])
		{
			if (s[i] >= 'А')
				
				sm = 97;
			else
				sm = 32;
			
			for (unsigned char j = 0; j < 5; j++)
				if (str)
					LCD5110_SendByte(~(pgm_read_byte(SmallFont[s[i]-sm]+j)>>4), 1); 
				else
					LCD5110_SendByte(~(pgm_read_byte(SmallFont[s[i]-sm]+j)<<4), 1);
				
			LCD5110_SendByte(0xFF, 1);
			i++;
		}
	}
	
}


void LCD5110_LargeNumPrints(char *s, unsigned char X, unsigned char Y)
{
	unsigned char n = 0;
	while (s[n])
	{
		LCD5110_SetXY(X+n*8, Y);
		
		unsigned char c;
		if (s[n] == ' ')
			c = 0;
		else
			if (s[n] == ':')
				c = 1;
			else
				c = s[n]-'0'+2;
				
		for (unsigned char i = 0; i < 16; i++)
		{
			LCD5110_SendByte(pgm_read_byte(LargeNum[c]+i), 1);	
			if (i == 7)
			LCD5110_SetXY(X+n*8, Y+1);	
		}
		n++;
	}
}