//***************************************************************************
//  Author(s):    Владимир Иванишин (http://de.my1.ru)
//  Target(s):    Encoder
//  Compiler:     GCC
//  Description:  Библиотека для работы с энкодером.
//  Data:         09.03.15
//***************************************************************************
// Описания файла: в данном файле находятся все функции работы с энкодером.
//
//			(В ФУНКЦИЯХ ИНКРЕМЕНТА И ДЕКРЕМЕНТА ПИШИТЕ СВОЙ КОД!!!)
//***************************************************************************
#include "ENC.h"
//***************************************************************************

//***************************************************************************
// Инициализация энкодера
//***************************************************************************
void ENC_Init(void)
{
	__ENC_PrevState = ((1<<__ENC_E1)|(1<<__ENC_E2));
	__ENC_But_CNT = __ENC_But_Delay;
	
	__ENC_DDR &= ~((1<<__ENC_E1)|(1<<__ENC_E2)|(1<<__ENC_But));
	__ENC_PORT |= ((1<<__ENC_E1)|(1<<__ENC_E2)|(1<<__ENC_But));
	
	SendTask(ENC_Check);
}

//***************************************************************************
// Проверка состояния энкодера
//***************************************************************************
void ENC_Check(void)
{
	if ( (__ENC_PrevState == ((1<<__ENC_E1)|(1<<__ENC_E2))) &&
			((__ENC_PIN&((1<<__ENC_E1)|(1<<__ENC_E2)))!=((1<<__ENC_E1)|(1<<__ENC_E2))) )
	{
		if ( (__ENC_PIN & ((1<<__ENC_E1)|(1<<__ENC_E2))) != ((1<<__ENC_E1)|(0<<__ENC_E2)) )
		{
			SendTask(ENC_Inc);
		}
		else
		{
			SendTask(ENC_Dec);
		}
	}
	__ENC_PrevState = __ENC_PIN & ((1<<__ENC_E1)|(1<<__ENC_E2));

	if (!(__ENC_PIN & (1<<__ENC_But)))										// Если кнопка нажата...
	{
		if (__ENC_But_CNT != 0)												// ...то если мы не отсчитали задержку длинного нажатия...
		{
			__ENC_But_CNT--;												// ...декрементируем счетчик задержки кнопки.
			if (__ENC_But_CNT == 0)											// Если наконец отсчитали нашу задержку...
			{
				SendTask(ENC_LongPress);									// ...вызываем обработчик длинного нажатия кнопки.
			}
		}
	}
	else																	// ...иначе, если кнопка отпущена...
	{
		if ((__ENC_But_CNT != 0) && (__ENC_But_CNT != __ENC_But_Delay))		// ...проверяем, если кнопка была нажата и это было не длинное нажатие...
		{
			SendTask(ENC_ShortPress);										// ...вызываем обработчик короткого нажатия кнопки.
		}
		__ENC_But_CNT = __ENC_But_Delay;									// Сбрасываем счетчик задержки длинного нажатия кнопки.
	}

	
	SendTimerTask(ENC_Check, __ENC_Time);
}

