//***************************************************************************
//  Author(s):    Владимир Иванишин (http://de.my1.ru)
//  Target(s):    Encoder
//  Compiler:     GCC
//  Description:  Библиотека для работы с энкодером.
//  Data:         09.03.15
//***************************************************************************
// Описания файла: в данном файле находятся все настройки.
//***************************************************************************
#include <avr/io.h>
#include "TM.h"

#define __ENC_DDR			DDRC		// Порт на котором висит энкодер
#define __ENC_PORT			PORTC		// Порт на котором висит энкодер
#define __ENC_PIN			PINC	
#define __ENC_E1			5			// Индекс пина, на котором висит первый выход энкодера
#define __ENC_E2			4			// Индекс пина, на котором висит второй выход энкодера
										// (Если энкодер "крутится" не в ту сторону - 
										// поменяйте эти значения друг с другом)
#define __ENC_But			3			// Индекс пина с кнопкой энкодера

#define __ENC_Time			5			// Период опроса энкодера в мс
#define __ENC_But_Delay		100			// Задержка длинного нажатия кнопки T = __ENC_Time * __ENC_But_Delay
//***************************************************************************
unsigned char __ENC_PrevState;
unsigned char __ENC_But_CNT;
//***************************************************************************
void ENC_Init(void);
void ENC_Check(void);
void ENC_Inc(void);
void ENC_Dec(void);
void ENC_ShortPress(void);
void ENC_LongPress(void);